# Introducción a Pandas

Esta es una introducción al paquete pandas, de uso común en ciencia de datos, significa *panel data* es un término de econometría; conjuntos de datos en intervalos temporales.

In [8]:
variable_python = "Alfonso"

In [9]:
print(variable_python)

Alfonso

Case:

- TitleCase: dotnet
- camelCase: java, javascript
- snake_case: python
- kebap-case: css

In [13]:
# esto es un comentario
# lo siguiente es una función
def hola_mundo():
    return "hola mundo"

In [15]:
hola_mundo()

'hola mundo'

# Instalar pandas

```bash
pip install pandas
```

```bash
conda install pandas
```

In [17]:
import pandas as pd
import numpy as np

# Series - Dataframes

Las *series* son columnas de datos. Un *dataframe* es una matriz compuesta de varias series (columnas). Vamos a crear un dataframe:

In [20]:
ventas = {
    "libros": [3, 2, 1, 0], 
    "discos": [0,1,2,3]
}

In [21]:
ventas

{'libros': [3, 2, 1, 0], 'discos': [0, 1, 2, 3]}

In [23]:
ventas_df = pd.DataFrame(ventas)

In [25]:
ventas_df

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [26]:
ventas_df.head() # devuelve los cinco primeros elementos

   libros  discos
0       3       0
1       2       1
2       1       2
3       0       3

In [28]:
ventas_df.head(2) # devuelve los dos primeros

   libros  discos
0       3       0
1       2       1

In [33]:
ventas_df[ ['libros'] ]

   libros
0       3
1       2
2       1
3       0

In [35]:
ventas_df[['discos','libros' ]]

   discos  libros
0       0       3
1       1       2
2       2       1
3       3       0

In [38]:
ventas_df = ventas_df[['discos','libros' ]]

In [40]:
ventas_df

   discos  libros
0       0       3
1       1       2
2       2       1
3       3       0

In [41]:
ventas_df.describe()

         discos    libros
count  4.000000  4.000000
mean   1.500000  1.500000
std    1.290994  1.290994
min    0.000000  0.000000
25%    0.750000  0.750000
50%    1.500000  1.500000
75%    2.250000  2.250000
max    3.000000  3.000000

In [43]:
ventas_df

   discos  libros
0       0       3
1       1       2
2       2       1
3       3       0

In [44]:
ventas_df = pd.DataFrame(ventas, index = ['Q1', 'Q2', 'Q3', 'Q4'])

In [46]:
ventas_df

    libros  discos
Q1       3       0
Q2       2       1
Q3       1       2
Q4       0       3

In [48]:
pd.read_csv('https://raw.githubusercontent.com/afoone/caipc-mar-2023/master/data/IMDB-Movie-Data.csv')

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Secret in Their Eyes,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
996,997,Hostel: Part II,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
997,998,Step Up 2: The Streets,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
998,999,Search Party,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
999,1000,Nine Lives,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0